In [15]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd

In [2]:
import getpass
password = getpass.getpass()

········

In [3]:
connection_string = "mysql+pymysql://root:" + password + "@localhost/sakila"

In [7]:
engine = create_engine(connection_string)

In [31]:
#Create a table rentals_may to store the data from rental table with information for the month of May.
engine.execute ("CREATE TABLE IF NOT EXISTS rentals_may SELECT * FROM rental LIMIT 0")

In [30]:
engine.execute ("DROP TABLE rentals_may")

In [32]:
#Insert values in the table rentals_may using the table rental, filtering values only for the month of May.
pd.read_sql("SELECT * FROM rentals_may", engine)

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update]
Index: []

In [37]:
engine.execute("""INSERT INTO rentals_may SELECT * 
FROM rental 
WHERE rental_date BETWEEN '2005_05_01' AND '2005_06_01'""")

In [38]:
pd.read_sql("SELECT * FROM rentals_may", engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [39]:
#Create a table rentals_june to store the data from rental table with information for the month of June.
#Insert values in the table rentals_june using the table rental, filtering values only for the month of June.

In [40]:
engine.execute ("CREATE TABLE IF NOT EXISTS rentals_june SELECT * FROM rental LIMIT 0")

In [41]:
pd.read_sql("SELECT * FROM rentals_june", engine)

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update]
Index: []

In [42]:
engine.execute("""INSERT INTO rentals_june SELECT * 
FROM rental 
WHERE rental_date BETWEEN '2005_06_01' AND '2005_07_01'""")

In [44]:
pd.read_sql("SELECT * FROM rentals_june ORDER BY rental_date", engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [53]:
#Check the number of rentals for each customer for May.
A = engine.execute(""" SELECT customer_id, COUNT(rental_id) 
FROM rentals_may
GROUP BY customer_id""")

In [60]:
DFMay = pd.read_sql(""" SELECT customer_id, COUNT(rental_id) as cri
FROM rentals_may
GROUP BY customer_id ORDER BY cri DESC""", engine)

In [58]:
#Check the number of rentals for each customer for June.

In [61]:
DFJune = pd.read_sql(""" SELECT customer_id, COUNT(rental_id) as cri
FROM rentals_june
GROUP BY customer_id ORDER BY cri DESC""", engine)

In [62]:
DFJune

     customer_id  cri
0             31   11
1            454   10
2            329    9
3            295    9
4            561    9
..           ...  ...
585          425    1
586          412    1
587          335    1
588           22    1
589          126    1

[590 rows x 2 columns]

In [63]:
#Write a function that checks if customer borrowed more or less books in the month of June as compared to May.